Reports/Рин1_ОборотыНоменклатурыПродажиЗакупкиПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Report>
		<Properties>
			<Name>Рин1_ОборотыНоменклатурыПродажиЗакупкиПроизводство</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/Рин1_ОборотыНоменклатурыПродажиЗакупкиПроизводство/Forms/ФормаОтчета/Ext/Form/Module.bsl
// + [Rineco], [Киселев А.] [22.07.2021] 
// Задача: [№ 12835], [#Выбор периода]

&НаКлиенте 
Процедура ВыбратьПериод(Команда) 
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();                                  
    Диалог.Период = Новый СтандартныйПериод(Отчет.ДатаНачала, Отчет.ДатаОкончания);         
    ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ВыполнитьПослеВыбораПериода",ЭтотОбъект); 
    Диалог.Показать(ОписаниеОповещенияОЗакрытии); 	 
КонецПроцедуры 

&НаКлиенте 
Процедура ВыполнитьПослеВыбораПериода(Результат, Параметры) Экспорт 
    Если Результат <> Неопределено Тогда 
        Отчет.ДатаНачала = Результат.ДатаНачала; 
        Отчет.ДатаОкончания = Результат.ДатаОкончания; 
    КонецЕсли;     
КонецПроцедуры 

// - [Rineco], [Киселев А.] [22.07.2021]


// + [Rineco], [Киселев А.] [22.07.2021] 
// Задача: [№ 12835], [#Заполнение параметров]
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПараметрКоманды") И ТипЗнч(Параметры.ПараметрКоманды) = Тип("СправочникСсылка.Номенклатура") Тогда
												 
		Отчет.Номенклатура = Параметры.ПараметрКоманды;
											 	
	КонецЕсли;
		
	Отчет.ДатаНачала = НачалоМесяца(ТекущаяДатаСеанса());
	Отчет.ДатаОкончания = КонецМесяца(ТекущаяДатаСеанса());
	
КонецПроцедуры
// - [Rineco], [Киселев А.] [22.07.2021]
